var a = "Hello World & Node.js";
console.log(a);
console.log(a);
console.log(a);
console.log(a);

// Nosejs 의 정의(공식 홈페이지의 설명)
//  Node.jsⓇ는 크롬 V8 자바스크립트 엔진으로 빌드된 자바스크립트 런타임입니다

// 노드는 서버가 아닌가요? 서버라는 말이 없네요.
//  - 서버의 역할도 수행할 수 있는 자바스크립트 런타임
//  - 노드로 자바스크립트로 작성된 서버를 실행할 수 있음.
//  - 서버 실행을 위해 필요한 http/https/http2 모듈을 제공

// 노드: 자바스크립트 런타임
// 런타임: 특정 언어로 만든 프로그램들을 실행할 수 있게 해주는 가상 머신의 상태
// 노드: 자바스크립트로 만든 프로그램들을 실행할 수 있게 해 줌
// 다른 런타임으로는 웹 브라우저(크롬, 엣지, 사파리, 파이어폭스 등)가 있음
// 노드 이전에도 자바스크립트 런타임을 만들기 위한 많은 시도를 했지만, 엔진 속도 문제로 실패

// MERN Stack 개발자
// MongoDB,  Express Server, React , Nodejs 의 앞자만 딴 풀스택 개발자를 가르키는 신조어
// MERN 이 등장하기 이전에는  Angular 가 React 자리에 들어가서 MEAN 이었지만  사용선호도가 Angular 보다 React가  높아지면서 MERN 으로 변형되었습니다.



